tap "abhimanyu003/sttr"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "minio/stable"
tap "robscott/tap"
tap "yoheimuta/protolint"
brew "xz"
brew "webp"
brew "icu4c"
brew "harfbuzz", link: false
brew "openjdk@11"
brew "apache-flink"
brew "readline"
brew "python@3.10"
brew "autojump"
brew "autossh"
brew "axel"
brew "bat"
brew "cmake"
brew "curl"
brew "diff-so-fancy"
brew "docker-compose"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gcc@11"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glab"
brew "gnu-sed"
brew "go"
brew "go@1.19", link: true
brew "python@3.11"
brew "graphviz"
brew "helm"
brew "htop"
brew "jenv"
brew "jq"
brew "kafka"
brew "librdkafka"
brew "kcat"
brew "keychain"
brew "knock"
brew "kt-connect"
brew "kubecm"
brew "lsd"
brew "masscan"
brew "maven"
brew "meson"
brew "minikube"
brew "minio-mc"
brew "mycli"
brew "mysql", restart_service: true
brew "node"
brew "nativefier"
brew "ncdu"
brew "neovim"
brew "nginx"
brew "nmap"
brew "nvm"
brew "openvpn"
brew "pgcli"
brew "protoc-gen-go"
brew "proxychains-ng"
brew "pstree"
brew "qemu"
brew "redis", restart_service: true
brew "rpm"
brew "rsync"
brew "rust"
brew "rustfmt"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "wireshark"
brew "yarn"
brew "zmap"
brew "abhimanyu003/sttr/sttr"
brew "goreleaser/tap/nfpm"
brew "robscott/tap/kube-capacity"
brew "yoheimuta/protolint/protolint"
cask "alfred"
cask "apipost"
cask "arc"
cask "battle-net"
cask "beyond-compare"
cask "bilibili"
cask "clion"
cask "dash4"
cask "docker"
cask "dozer"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-monofur-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "iina"
cask "intellij-idea"
cask "intellij-idea-ce"
cask "jd-gui"
cask "jietu"
cask "macvim"
cask "maczip"
cask "meld"
cask "mweb-pro"
cask "neteasemusic"
cask "omnigraffle"
cask "satellite-eyes"
cask "steam"
cask "sunloginclient"
cask "teamviewer"
cask "tencent-lemon"
cask "utm"
cask "utools"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "vmware-fusion"
cask "wechat"
cask "wireshark"
cask "ximalaya"
cask "yinxiangbiji"
cask "youku"
