tap "abhimanyu003/sttr"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "minio/stable"
tap "robscott/tap"
tap "yoheimuta/protolint"
brew "xz"
brew "webp"
brew "icu4c"
brew "harfbuzz", link: false
brew "openjdk@11"
brew "apache-flink"
brew "readline"
brew "python@3.10"
brew "autojump"
brew "autossh"
brew "axel"
brew "bat"
brew "cmake"
brew "curl"
brew "diff-so-fancy"
brew "docker-compose"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gcc@11"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glab"
brew "gnu-sed"
brew "go"
brew "go@1.19", link: true
brew "python@3.11"
brew "graphviz"
brew "helm"
brew "htop"
brew "jenv"
brew "jq"
brew "kafka"
brew "librdkafka"
brew "kcat"
brew "keychain"
brew "knock"
brew "kt-connect"
brew "kubecm"
brew "lsd"
brew "masscan"
brew "maven"
brew "meson"
brew "minikube"
brew "minio-mc"
brew "mycli"
brew "mysql", restart_service: true
brew "node"
brew "nativefier"
brew "ncdu"
brew "neovim"
brew "nginx"
brew "nmap"
brew "nvm"
brew "openvpn"
brew "pgcli"
brew "protoc-gen-go"
brew "proxychains-ng"
brew "pstree"
brew "qemu"
brew "redis", restart_service: true
brew "rpm"
brew "rsync"
brew "rust"
brew "rustfmt"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "wireshark", link: false
brew "yarn"
brew "zmap"
brew "abhimanyu003/sttr/sttr"
brew "goreleaser/tap/nfpm"
brew "robscott/tap/kube-capacity"
brew "yoheimuta/protolint/protolint"
cask "alfred"
cask "apipost"
cask "dash4"
cask "docker"
cask "dozer"
cask "font-hack-nerd-font"
cask "font-monofur-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "iina"
cask "jd-gui"
cask "jietu"
cask "maczip"
cask "meld"
cask "mweb-pro"
cask "neteasemusic"
cask "omnigraffle"
cask "utm"
cask "utools"
cask "visual-studio-code-insiders"
cask "wechat"
cask "wireshark"
vscode "bpfdeploy.bpftrace"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "coolbear.systemd-unit-file"
vscode "cweijan.vscode-mysql-client2"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "genieai.chatgpt-vscode"
vscode "GitHub.copilot-nightly"
vscode "GitHub.remotehub"
vscode "golang.go"
vscode "hideoo.create"
vscode "humao.rest-client"
vscode "jakob101.RelativePath"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeppeandersen.vscode-kafka"
vscode "lucax88x.codeacejumper"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "minifigone.archive-browser"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "mtxr.sqltools"
vscode "njpwerner.autodocstring"
vscode "PKief.material-icon-theme"
vscode "pucelle.vscode-css-navigation"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "ryuta46.multi-command"
vscode "sainnhe.sonokai"
vscode "samuelcolvin.jinjahtml"
vscode "stylelint.vscode-stylelint"
vscode "Tim-Koehler.helm-intellisense"
vscode "Tobermory.es6-string-html"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "VisualStudioExptTeam.vscodeintellicode-completions"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-ext.sync-rsync"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "zxh404.vscode-proto3"
