tap "discoteq/discoteq"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# SSL/TLS cryptography library
brew "openssl"
# Download with resuming and segmented downloading
brew "aria2"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interface bandwidth monitor
brew "bmon"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Clean Docker containers, images, networks, and volumes
brew "docker-clean"
# Run arbitrary commands when files change
brew "entr"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU typing tutor
brew "gnu-typist"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Kubernetes command-line interface
brew "kubernetes-cli"
# TCP port scanner, scans entire Internet in under 5 minutes
brew "masscan"
# Interpreted, interactive, object-oriented programming language
brew "python@2"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# High-performance, schema-free, document-oriented database
brew "mongodb"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Platform built on V8 to build network applications
brew "node"
# Wrap web apps natively
brew "nativefier"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Trigger notifications when a process completes
brew "noti"
# Read-write NTFS driver for FUSE
brew "ntfs-3g"
# Open source computer vision library
brew "opencv"
# Shell command parallelization utility
brew "parallel"
# Python dependency management tool
brew "pipenv"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Hook preloader
brew "proxychains-ng"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Full-text search engine
brew "sphinx"
# Secure pipe daemon
brew "spiped"
# File system client based on SSH File Transfer Protocol
brew "sshfs"
# User interface to the TELNET protocol (built from macOS Sierra sources)
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Run Windows applications without a copy of Microsoft Windows
brew "wine"
# Tips, tricks, and examples for zsh
brew "zsh-lovers"
brew "discoteq/discoteq/flock"
cask "balenaetcher"
cask "docker"
cask "dozer"
cask "ezip"
cask "font-monofur-nerd-font"
cask "genymotion"
cask "goland"
cask "iina"
cask "java"
cask "java8"
cask "jietu"
cask "kitematic"
cask "macvim"
cask "sloth"
cask "spark"
cask "steam"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vmware-fusion"
cask "wireshark"
cask "xquartz"
